In [10]:
# factorial

def factorial(num):
    fact = 1
    for i in range(1,num+1):
        fact=fact*i
    print("Factorail of ",num," is = ",fact)

factorial(5)

Factorail of  5  is =  120

In [12]:
# fibonacci
num = int(input("How many numbers? "))

n1, n2 = 0, 1
count = 0

if num <= 0:
    print("Invalid input 0")
elif num == 1:
    print("Fibonacci series: 0")
else:
    print("Fibonacci series:")
    while count < num:
        print(n1, end=" ")
        n3 = n1 + n2
        n1 = n2
        n2 = n3
        count += 1

Fibonacci series:
0 1 1 2 3 5 8 13 21 34

In [12]:
# vowel dictionary
str = "hello world, good morning"
voweldict = {"a":0,"e":0,"i":0,"o":0,"u":0}
for i in str:
    if i in voweldict:
        voweldict[i]+=1
print(voweldict)

totalv = sum(voweldict.values())
print(totalv)
for k,v in voweldict.items():
    print(f"{k} : {(v/totalv)*100:.2f} %")

{'a': 0, 'e': 1, 'i': 1, 'o': 5, 'u': 0}
7
a : 0.00 %
e : 14.29 %
i : 14.29 %
o : 71.43 %
u : 0.00 %

In [16]:
# print histogram of frequencies
str = input("enter string")
for i,word in enumerate(str):
    if str[:i].count(word)==0:
        freq = str.count(word)
        print(word,"-","*"*freq)

h - *
e - *
l - **
o - *

In [1]:
# change first and last     
name = "abcxyz"
f = name[0]
l = name[-1]
print(l+name[1:-1]+f)

zbcxya

In [27]:
# math mark teacher
math = [85,90,75,80,95]
math.sort(reverse=True)
sh = math[1]
sl = math[-2]
print(math)
print("Second Highest marks - ",sh)
print("Second Lowest marks - ",sl)

[95, 90, 85, 80, 75]
Second Highest marks -  90
Second Lowest marks -  80

In [28]:
# mul of 5
roll = [5,10,15,24,65,12,13,6,50,25]
for i in roll:
    if i%5==0:
        print(i)

5
10
15
65
50
25

In [33]:
num = input("Enter number that consist only 0 and 1")
count_0 = num.count('0')
count_1 = num.count('1')

result = "yes" if count_0 == 1 or count_1==1 else"No"
print(result)

No

In [35]:
nametup = ("abc","xyz","pqrs")
for i in nametup:
    print(len(i))

3
3
4

In [41]:
name = ["abc","xyz","pqr"]
marks = [70,80,90]
nmdict={}
for n,m in zip(name,marks):
    nmdict[n]=m
print(nmdict)

{'abc': 70, 'xyz': 80, 'pqr': 90}

In [45]:
# sets
s1 = set()
s2 = set()
for i in range(1,101):
    if i%2==0:
        s1.add(i)

for i in range(1,11):
    sq = i*i
    s2.add(sq)

print("union of s1 and s2",s1.union(s2))
print("diffrence of s1 and s2",s1.difference(s2))
print("intersection of s1 and s2",s1.intersection(s2))

union of s1 and s2 {1, 2, 4, 6, 8, 9, 10, 12, 14, 16, 18, 20, 22, 24, 25, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 49, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 81, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100}
diffrence of s1 and s2 {2, 6, 8, 10, 12, 14, 18, 20, 22, 24, 26, 28, 30, 32, 34, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98}
intersection of s1 and s2 {64, 100, 4, 36, 16}

In [46]:
# count +ve and -ve in list
l = [5,-2,8,-3,1,-1,3,2,9,-7]
cp=0
cn=0
for i in l:
    if(i<=0):
        cn+=1
    else:
        cp+=1
print("Positive",cp)
print("Negative",cn)

Positive 6
Negative 4

In [52]:
# find word longer then n
names = ["abc","xyzc","pqrs","mno"]
n = int(input("enter n"))
for nm in names:
    if (len(nm)>n):
        print(nm)

xyzc
pqrs

In [53]:
l = [[1,2,3],[4,5,6],[7,8,9],[10,11,12]]
maxl = max(l,key=sum)
print(maxl)

[10, 11, 12]

In [ ]:
# mul and sub function
num = int(input("Enter number : "))

def mul(num):
    return num*3

def sub(num):
    n = mul(num)
    return n-2

sub(num)

13

In [60]:
# default value in constructor
def student(std="1",sn="abc"):
    print(std,sn)
student()
student(5,"xyz")

1 abc
5 xyz

In [63]:
import math
sq = [4,9,16,25]
l = [math.sqrt(i) for i in sq]
print(l)

[2.0, 3.0, 4.0, 5.0]

In [72]:
# i)
student = {"john":86.5,"jack":91.2,"jill":84.5,"harry":72.1,"joe":80.5}
for n,m in student.items():
    print("Name-",n," : ","Marks-",m)

# ii) 
def get_marks(i):
    return i[1]
sl = list(student.items())
sl.sort(key=get_marks,reverse=True)

print("Top two scores")
for n,m in sl[:2]:
    print(print("Name-",n," : ","Marks-",m)) 
# iii)
avg=0
for i in student:
    avg += student[i]
print(avg/len(student))

Name- john  :  Marks- 86.5
Name- jack  :  Marks- 91.2
Name- jill  :  Marks- 84.5
Name- harry  :  Marks- 72.1
Name- joe  :  Marks- 80.5
Top two scores
Name- jack  :  Marks- 91.2
None
Name- john  :  Marks- 86.5
None
82.96

In [83]:
java_course = {"John", "Jack", "Jill", "Joe"}
python_course = {"Jake", "John", "Eric", "Jill"}

# i) 
print("Python course",len(python_course))
print("Python course",python_course)

# ii) 
print("Java course only",len(java_course.difference(python_course)))
print("Java course only",java_course.difference(python_course))

# iii) 
print("Python course only",len(python_course.difference(java_course)))
print("Python course only",python_course.difference(java_course))

# iv) 
print("Both Java and Python ",len(python_course.intersection(java_course)))
print("Both Java and Python ",python_course.intersection(java_course))

# v)
oj = java_course.difference(python_course)
op = python_course.difference(java_course)
print("either java or python but not both",oj.union(op))

# vi)
print("Both Java and Python ",len(python_course.union(java_course)))
print("Both Java and Python ",python_course.union(java_course))

Python course 4
Python course {'Jake', 'John', 'Eric', 'Jill'}
Java course only 2
Java course only {'Jack', 'Joe'}
Python course only 2
Python course only {'Jake', 'Eric'}
Both Java and Python  2
Both Java and Python  {'John', 'Jill'}
either java or python but not both {'Jack', 'Eric', 'Jake', 'Joe'}
Both Java and Python  6
Both Java and Python  {'Jill', 'Jake', 'John', 'Eric', 'Jack', 'Joe'}

In [ ]:
# with list
import numpy as np
import pandas as pd

a = ["A","B","C","D"]
b = [1,2,3,4]
ls = pd.Series(a,index=b)
print(s)

1    A
2    B
3    C
4    D
dtype: object

In [90]:
# with dictionary
a = {"A":1,"B":2,"C":3,"D":4,"E":5}
ds = pd.Series(a)
print(ds)

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [ ]:
# numpy array
na = np.array([10,20,30,40,50])
print(na)

[10 20 30 40 50]

np.int64(150)

In [94]:
data = {"Name":["abc","xyz","pqr"],"age":[10,20,30]}
df1 = pd.DataFrame(data)
df1

  Name  age
0  abc   10
1  xyz   20
2  pqr   30

In [96]:
data = [
    {"Name":"Abc","Age":10},
    {"Name":"Xyz","Age":20},
    {"Name":"Pqr","Age":30}
]
df2 = pd.DataFrame(data,index = [1,2,3])
df2

  Name  Age
1  Abc   10
2  Xyz   20
3  Pqr   30

In [1]:
data2 = {
    'Store': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar'],
    'Sales': [100, 150, 200, 250, 300, 350]
}
df2 = pd.DataFrame(data2)

NameError: name 'pd' is not defined

In [102]:
total_sales = df2.groupby(['Month','Store'])['Sales'].agg(["sum"])
total_sales

             sum
Month Store
Feb   A      200
      B      250
Jan   A      100
      B      150
Mar   A      300
      B      350

In [103]:
import pandas as pd

data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, 70000, 65000, 58000]
}
df = pd.DataFrame(data)
print(df['Department'].unique)
print(df['Department'].nunique)

<bound method Series.unique of 0    HR
1    IT
2    HR
3    IT
4    IT
5    HR
Name: Department, dtype: object>
<bound method IndexOpsMixin.nunique of 0    HR
1    IT
2    HR
3    IT
4    IT
5    HR
Name: Department, dtype: object>

In [104]:
avg_salary = df.groupby('Department')['Salary'].mean()
avg_salary

Department
HR    54333.333333
IT    65000.000000
Name: Salary, dtype: float64

In [105]:
salary_agg = df.groupby('Department')['Salary'].agg(['sum','mean','max'])
salary_agg

               sum          mean    max
Department
HR          163000  54333.333333  58000
IT          195000  65000.000000  70000

In [ ]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 16600, 12500], index = ['C', 'B', 'A'])

data = {'ProductName':ser_products, 'ProductPrice':ser_prices}
df = pd.DataFrame(data)

df

  ProductName  ProductPrice
A   Product A         12500
B   Product B         16600
C   Product C         22250

In [9]:
guitar = {"aarav","bhavya","chirag","divya","esha"}
piano = {"bhavya","chirag","esha","farhan","gauri"}
violin = {"chirag","divya","esha","gauri","harsh"}

all3 = guitar.union(piano).union(violin)
print("i)",all3)

g1 = guitar.difference(piano).difference(violin)
print(g1)
p1 = piano.difference(guitar).difference(violin)
print(p1)
v1 = violin.difference(piano).difference(guitar)
print(v1)
atleast1 = g1.union(p1).union(v1)
print("ii)",atleast1)

g2 = guitar.intersection(piano).intersection(violin)
p2 = piano.intersection(guitar).intersection(violin)
v2 = violin.intersection(piano).intersection(guitar)
atleast2 = g2.union(p2).union(v2)
print("iii)",atleast2)

i) {'divya', 'esha', 'bhavya', 'chirag', 'farhan', 'aarav', 'harsh', 'gauri'}
{'aarav'}
{'farhan'}
{'harsh'}
ii) {'farhan', 'aarav', 'harsh'}
iii) {'chirag', 'esha'}

In [24]:
str = "hello i am world good morning"
ss = str.split()
print(ss)
short = ss[0]
long = ss[0]

for i in ss:
    if len(i)<len(short):
        short=i
    elif len(i)>=len(long):
        long=i
    
print(short)
print(long)

['hello', 'i', 'am', 'world', 'good', 'morning']
i
morning

In [34]:
def long_word_per(sentence):
    ss = sentence.split()
    l = []
    for i in ss:
        if len(i)>=6:
            l.append(i)
    return l    

str="helloo world , good morning !"
ss = str.split()
tl = len(ss)
ml = len(long_word_per(str))
print(ml/tl*100)

33.33333333333333